; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image3 - mode
	image1 - mode
	image0 - mode
	infrared2 - mode
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image1)
	(supports instrument2 image3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 102)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 158)
	(supports instrument4 image1)
	(supports instrument4 infrared2)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 127)
	(= (data Phenomenon5 image3) 4)
	(= (data Phenomenon6 image3) 230)
	(= (data Star7 image3) 16)
	(= (data Phenomenon8 image3) 140)
	(= (data Phenomenon5 image1) 2)
	(= (data Phenomenon6 image1) 69)
	(= (data Star7 image1) 207)
	(= (data Phenomenon8 image1) 81)
	(= (data Phenomenon5 image0) 178)
	(= (data Phenomenon6 image0) 110)
	(= (data Star7 image0) 295)
	(= (data Phenomenon8 image0) 92)
	(= (data Phenomenon5 infrared2) 24)
	(= (data Phenomenon6 infrared2) 111)
	(= (data Star7 infrared2) 182)
	(= (data Phenomenon8 infrared2) 299)
	(= (slew_time Star2 Star0) 6.146)
	(= (slew_time Star0 Star2) 6.146)
	(= (slew_time Star2 GroundStation1) 57.36)
	(= (slew_time GroundStation1 Star2) 57.36)
	(= (slew_time GroundStation1 Star0) 1.524)
	(= (slew_time Star0 GroundStation1) 1.524)
	(= (slew_time GroundStation3 Star0) 1.958)
	(= (slew_time Star0 GroundStation3) 1.958)
	(= (slew_time GroundStation3 GroundStation1) 35.15)
	(= (slew_time GroundStation1 GroundStation3) 35.15)
	(= (slew_time GroundStation3 Star2) 67.21)
	(= (slew_time Star2 GroundStation3) 67.21)
	(= (slew_time GroundStation4 Star0) 60.76)
	(= (slew_time Star0 GroundStation4) 60.76)
	(= (slew_time GroundStation4 GroundStation1) 10.93)
	(= (slew_time GroundStation1 GroundStation4) 10.93)
	(= (slew_time GroundStation4 Star2) 22.61)
	(= (slew_time Star2 GroundStation4) 22.61)
	(= (slew_time GroundStation4 GroundStation3) 56.69)
	(= (slew_time GroundStation3 GroundStation4) 56.69)
	(= (slew_time Phenomenon5 Star0) 33.44)
	(= (slew_time Star0 Phenomenon5) 33.44)
	(= (slew_time Phenomenon5 GroundStation1) 17.95)
	(= (slew_time GroundStation1 Phenomenon5) 17.95)
	(= (slew_time Phenomenon5 Star2) 7.707)
	(= (slew_time Star2 Phenomenon5) 7.707)
	(= (slew_time Phenomenon5 GroundStation3) 11.5)
	(= (slew_time GroundStation3 Phenomenon5) 11.5)
	(= (slew_time Phenomenon5 GroundStation4) 77.16)
	(= (slew_time GroundStation4 Phenomenon5) 77.16)
	(= (slew_time Phenomenon6 Star0) 26.26)
	(= (slew_time Star0 Phenomenon6) 26.26)
	(= (slew_time Phenomenon6 GroundStation1) 29.08)
	(= (slew_time GroundStation1 Phenomenon6) 29.08)
	(= (slew_time Phenomenon6 Star2) 0.2471)
	(= (slew_time Star2 Phenomenon6) 0.2471)
	(= (slew_time Phenomenon6 GroundStation3) 35)
	(= (slew_time GroundStation3 Phenomenon6) 35)
	(= (slew_time Phenomenon6 GroundStation4) 17.27)
	(= (slew_time GroundStation4 Phenomenon6) 17.27)
	(= (slew_time Phenomenon6 Phenomenon5) 81.94)
	(= (slew_time Phenomenon5 Phenomenon6) 81.94)
	(= (slew_time Star7 Star0) 7.586)
	(= (slew_time Star0 Star7) 7.586)
	(= (slew_time Star7 GroundStation1) 58.53)
	(= (slew_time GroundStation1 Star7) 58.53)
	(= (slew_time Star7 Star2) 30.03)
	(= (slew_time Star2 Star7) 30.03)
	(= (slew_time Star7 GroundStation3) 21.54)
	(= (slew_time GroundStation3 Star7) 21.54)
	(= (slew_time Star7 GroundStation4) 42.24)
	(= (slew_time GroundStation4 Star7) 42.24)
	(= (slew_time Star7 Phenomenon5) 22.13)
	(= (slew_time Phenomenon5 Star7) 22.13)
	(= (slew_time Star7 Phenomenon6) 32.27)
	(= (slew_time Phenomenon6 Star7) 32.27)
	(= (slew_time Phenomenon8 Star0) 48.15)
	(= (slew_time Star0 Phenomenon8) 48.15)
	(= (slew_time Phenomenon8 GroundStation1) 1.088)
	(= (slew_time GroundStation1 Phenomenon8) 1.088)
	(= (slew_time Phenomenon8 Star2) 37.9)
	(= (slew_time Star2 Phenomenon8) 37.9)
	(= (slew_time Phenomenon8 GroundStation3) 12.91)
	(= (slew_time GroundStation3 Phenomenon8) 12.91)
	(= (slew_time Phenomenon8 GroundStation4) 62.55)
	(= (slew_time GroundStation4 Phenomenon8) 62.55)
	(= (slew_time Phenomenon8 Phenomenon5) 18.9)
	(= (slew_time Phenomenon5 Phenomenon8) 18.9)
	(= (slew_time Phenomenon8 Phenomenon6) 10.07)
	(= (slew_time Phenomenon6 Phenomenon8) 10.07)
	(= (slew_time Phenomenon8 Star7) 54.62)
	(= (slew_time Star7 Phenomenon8) 54.62)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Phenomenon8)
	(have_image Phenomenon5 image3)
	(have_image Star7 infrared2)
	(have_image Phenomenon8 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 groundstation1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 158 to 140.05, (fuel-used) from 0 to 17.95
   goals met: 0 of 4
2. (turn_to satellite0 groundstation1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 102 to 100.912, (fuel-used) from 17.95 to 19.038
   goals met: 0 of 4
3. (turn_to satellite1 phenomenon8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 140.05 to 138.962, (fuel-used) from 19.038 to 20.126
   goals met: 1 of 4
4. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 4
5. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 4
6. (turn_to satellite0 phenomenon5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 100.912 to 82.962, (fuel-used) from 20.126 to 38.076
   goals met: 1 of 4
7. (turn_to satellite2 groundstation3 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 127 to 114.09, (fuel-used) from 38.076 to 50.986
   goals met: 1 of 4
8. (turn_to satellite2 phenomenon8 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 114.09 to 101.18, (fuel-used) from 50.986 to 63.896
   goals met: 1 of 4
9. (turn_to satellite2 groundstation1 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 101.18 to 100.092, (fuel-used) from 63.896 to 64.984
   goals met: 1 of 4
10. (turn_to satellite2 star0 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 100.092 to 98.568, (fuel-used) from 64.984 to 66.508
   goals met: 1 of 4
11. (turn_to satellite2 star7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 98.568 to 90.982, (fuel-used) from 66.508 to 74.094
   goals met: 1 of 4
12. (turn_to satellite2 groundstation3 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 90.982 to 69.442, (fuel-used) from 74.094 to 95.634
   goals met: 1 of 4
13. (turn_to satellite2 star0 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 69.442 to 67.484, (fuel-used) from 95.634 to 97.592
   goals met: 1 of 4
14. (turn_to satellite2 groundstation1 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 67.484 to 65.96, (fuel-used) from 97.592 to 99.116
   goals met: 1 of 4
15. (turn_to satellite2 groundstation3 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 65.96 to 30.81, (fuel-used) from 99.116 to 134.266
   goals met: 1 of 4
16. (turn_to satellite2 star0 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 30.81 to 28.852, (fuel-used) from 134.266 to 136.224
   goals met: 1 of 4
17. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 4
18. (turn_to satellite2 groundstation3 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 28.852 to 26.894, (fuel-used) from 136.224 to 138.182
   goals met: 1 of 4
19. (calibrate satellite2 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 1 of 4
20. (turn_to satellite2 star0 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 26.894 to 24.936, (fuel-used) from 138.182 to 140.14
   goals met: 1 of 4
21. (turn_to satellite2 star7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 24.936 to 17.35, (fuel-used) from 140.14 to 147.726
   goals met: 1 of 4
22. (take_image satellite2 star7 instrument4 infrared2)
   added: (have_image star7 infrared2)
   changed: (data_capacity satellite2) from 1000 to 818, (data-stored) from 0 to 182
   goals met: 2 of 4
23. (turn_to satellite2 star0 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 17.35 to 9.764, (fuel-used) from 147.726 to 155.312
   goals met: 2 of 4
24. (turn_to satellite2 groundstation1 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 9.764 to 8.24, (fuel-used) from 155.312 to 156.836
   goals met: 2 of 4
25. (turn_to satellite2 phenomenon8 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 8.24 to 7.152, (fuel-used) from 156.836 to 157.924
   goals met: 2 of 4
26. (take_image satellite0 phenomenon5 instrument2 image3)
   added: (have_image phenomenon5 image3)
   changed: (data_capacity satellite0) from 1000 to 996, (data-stored) from 182 to 186
   goals met: 3 of 4
27. (take_image satellite2 phenomenon8 instrument4 image1)
   added: (have_image phenomenon8 image1)
   changed: (data_capacity satellite2) from 818 to 737, (data-stored) from 186 to 267
   goals met: 4 of 4
